1.为什么更推荐结合使用IPFS以及Filecoin为项目提供去中心化存储？
答：
IPFS是专门为Web3设计，继承了所有内容寻址的优势，为很多Web3项目提供存储,结合Filecoin + IPFS,更能提供简易使用方式，营造出更好的web3生态环境。

2. 如何在IPFS上访问存储的文件或者数据？举例说明你能想到的办法
答：可以通过 IPFS Desktop、IPFS CLI、Opera浏览器、brave浏览器以及IPFS公共网关

3. 有几种方式运行IPFS节点？分别是什么？
答：有三种，分别是 Desktop、CLI和IPFS Cluster

4. 为什么目前使用Filecoin以及IPFS提供存储服务的工具可以提供免费服务？
答：先免费使用，降低用户使用门槛，提高市场占有率，形成使用习惯，再开拓商务应用，完善整个生态。


5. 对比 “使用存储服务的工具” VS “使用Filecoin节点直接进行存储”的各种不同点？
使用Filecoin节点直接进行存储，对系统的要求比较高，需要对Filecoin的原理深刻了解，交互方式主要通过命令行api方式；
使用存储服务的工具，无需维护本地节点，不直接接触底层Filecoin节点，用户上手简单。


